podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/ADC0_MK82F25615.svd.xml
<!--
Devices using this peripheral: 
      MK82F25615
      MKL82Z7
-->
      <peripheral>
         <?sourceFile "ADC0_MK82F25615" ?>
         <name>ADC0</name>
         <description>Analog-to-Digital Converter</description>
         <groupName>ADC</groupName>
         <prependToName>ADC0_</prependToName>
         <headerStructName>ADC</headerStructName>
         <baseAddress>0x4003B000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x50</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x54</offset>
            <size>0x1C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>A,B</dimIndex>
               <name>SC1%s</name>
               <description>ADC Status and Control Registers 1</description>
               <addressOffset>0x0</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>ADCH</name>
                     <description>Input channel select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00000</name>
                           <description>When DIFF=0, DADP0 is selected as input; when DIFF=1, DAD0 is selected as input</description>
                           <value>0b00000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00001</name>
                           <description>When DIFF=0, DADP1 is selected as input; when DIFF=1, DAD1 is selected as input</description>
                           <value>0b00001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00010</name>
                           <description>When DIFF=0, DADP2 is selected as input; when DIFF=1, DAD2 is selected as input</description>
                           <value>0b00010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00011</name>
                           <description>When DIFF=0, DADP3 is selected as input; when DIFF=1, DAD3 is selected as input</description>
                           <value>0b00011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00100</name>
                           <description>When DIFF=0, AD4 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b00100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00101</name>
                           <description>When DIFF=0, AD5 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b00101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00110</name>
                           <description>When DIFF=0, AD6 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b00110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00111</name>
                           <description>When DIFF=0, AD7 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b00111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01000</name>
                           <description>When DIFF=0, AD8 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b01000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01001</name>
                           <description>When DIFF=0, AD9 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b01001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01010</name>
                           <description>When DIFF=0, AD10 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b01010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01011</name>
                           <description>When DIFF=0, AD11 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b01011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01100</name>
                           <description>When DIFF=0, AD12 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b01100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01101</name>
                           <description>When DIFF=0, AD13 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b01101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01110</name>
                           <description>When DIFF=0, AD14 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b01110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01111</name>
                           <description>When DIFF=0, AD15 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b01111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10000</name>
                           <description>When DIFF=0, AD16 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b10000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10001</name>
                           <description>When DIFF=0, AD17 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b10001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10010</name>
                           <description>When DIFF=0, AD18 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b10010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10011</name>
                           <description>When DIFF=0, AD19 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b10011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10100</name>
                           <description>When DIFF=0, AD20 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b10100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10101</name>
                           <description>When DIFF=0, AD21 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b10101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10110</name>
                           <description>When DIFF=0, AD22 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b10110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10111</name>
                           <description>When DIFF=0, AD23 is selected as input; when DIFF=1, it is reserved</description>
                           <value>0b10111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11010</name>
                           <description>When DIFF=0, Temp Sensor (single-ended) is selected as input; when DIFF=1, Temp Sensor (differential) is selected as input</description>
                           <value>0b11010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11011</name>
                           <description>When DIFF=0, Bandgap (single-ended) is selected as input; when DIFF=1, Bandgap (differential) is selected as input</description>
                           <value>0b11011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11101</name>
                           <description>When DIFF=0,VREFSH is selected as input; when DIFF=1, -VREFSH (differential) is selected as input. Voltage reference selected is determined by SC2[REFSEL]</description>
                           <value>0b11101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11110</name>
                           <description>When DIFF=0,VREFSL is selected as input; when DIFF=1, it is reserved. Voltage reference selected is determined by SC2[REFSEL]</description>
                           <value>0b11110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11111</name>
                           <description>Module is disabled</description>
                           <value>0b11111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFF</name>
                     <description>Differential Mode Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Single-ended conversions and input channels are selected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Differential conversions and input channels are selected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AIEN</name>
                     <description>Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Conversion complete interrupt is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Conversion complete interrupt is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COCO</name>
                     <description>Conversion Complete Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Conversion is not completed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Conversion is completed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFG1</name>
               <description>ADC Configuration Register 1</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>ADICLK</name>
                     <description>Input Clock Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Bus clock</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Alternate clock 2 (ALTCLK2)</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Alternate clock (ALTCLK)</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Asynchronous clock (ADACK)</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Conversion mode selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>When DIFF=0:It is single-ended 8-bit conversion; when DIFF=1, it is differential 9-bit conversion with 2&apos;s complement output</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>When DIFF=0:It is single-ended 12-bit conversion ; when DIFF=1, it is differential 13-bit conversion with 2&apos;s complement output</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>When DIFF=0:It is single-ended 10-bit conversion. ; when DIFF=1, it is differential 11-bit conversion with 2&apos;s complement output</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>When DIFF=0:It is single-ended 16-bit conversion..; when DIFF=1, it is differential 16-bit conversion with 2&apos;s complement output</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADLSMP</name>
                     <description>Sample Time Configuration</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Short sample time</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Long sample time</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADIV</name>
                     <description>Clock Divide Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>The divide ratio is 1 and the clock rate is input clock</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>The divide ratio is 2 and the clock rate is (input clock)/2</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>The divide ratio is 4 and the clock rate is (input clock)/4</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>The divide ratio is 8 and the clock rate is (input clock)/8</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADLPC</name>
                     <description>Low-Power Configuration</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal power configuration</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Low-power configuration. The power is reduced at the expense of maximum clock speed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
