podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/ADC0_MK82F25615.svd.xml
            <register>
               <name>CLMS</name>
               <description>ADC Minus-Side General Calibration Value Register</description>
               <addressOffset>0x58</addressOffset>
               <resetValue>0x20</resetValue>
               <fields>
                  <field>
                     <name>CLMS</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLM4</name>
               <description>ADC Minus-Side General Calibration Value Register</description>
               <addressOffset>0x5C</addressOffset>
               <resetValue>0x200</resetValue>
               <fields>
                  <field>
                     <name>CLM4</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLM3</name>
               <description>ADC Minus-Side General Calibration Value Register</description>
               <addressOffset>0x60</addressOffset>
               <resetValue>0x100</resetValue>
               <fields>
                  <field>
                     <name>CLM3</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLM2</name>
               <description>ADC Minus-Side General Calibration Value Register</description>
               <addressOffset>0x64</addressOffset>
               <resetValue>0x80</resetValue>
               <fields>
                  <field>
                     <name>CLM2</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLM1</name>
               <description>ADC Minus-Side General Calibration Value Register</description>
               <addressOffset>0x68</addressOffset>
               <resetValue>0x40</resetValue>
               <fields>
                  <field>
                     <name>CLM1</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLM0</name>
               <description>ADC Minus-Side General Calibration Value Register</description>
               <addressOffset>0x6C</addressOffset>
               <resetValue>0x20</resetValue>
               <fields>
                  <field>
                     <name>CLM0</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
